html/on-the-future-of-neural-networks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>On the future of neural networks</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">On the future of neural networks</h1>
<p>
<a href="http://neuralnetworksanddeeplearning.com/chap6.html#on_the_future_of_neural_networks">http://neuralnetworksanddeeplearning.com/chap6.html#on_the_future_of_neural_networks</a>
</p>

<p>
Addressing these questions comprehensively would take a separate book. Instead, let me offer one observation. It's based on an idea known as <a href="http://en.wikipedia.org/wiki/Conway's_law">Conway's law</a>:
</p>

<blockquote>
<p>
Any organization that designs a system&#x2026; will inevitably produce a design whose structure is a copy of the organization's communication structure.
</p>
</blockquote>

<p>
This is a common pattern that has been repeated in many well-established sciences: not just medicine, but physics, mathematics, chemistry, and others. The fields start out monolithic, with just a few deep ideas. Early experts can master all those ideas. But as time passes that monolithic character changes. We discover many deep new ideas, too many for any one person to really master. As a result, the social structure of the field re-organizes and divides around those ideas. Instead of a monolith, we have fields within fields within fields, a complex, recursive, self-referential social structure, whose organization mirrors the connections between our deepest insights. And so the structure of our knowledge shapes the social organization of science. But that social shape in turn constrains and helps determine what we can discover. This is the scientific analogue of Conway's law.
</p>

<p>
My frank opinion is this: it's too early to say. As the old joke goes, if you ask a scientist how far away some discovery is and they say "10 years" (or more), what they mean is "I've got no idea". AI, like controlled fusion and a few other technologies, has been 10 years away for 60 plus years.
</p>
</div>
</body>
</html>
